In [1]:
import pdx
print(pdx.__version__)

0.4.0

In [2]:
iris = pdx.data.get_iris()

# long version

In [3]:
print(open('long.sql').read())

select
    species,
    count(*)
        as num,
from
    tbl
group by
    1

In [4]:
pdx.sql('long.sql', tbl=iris)

      species  num
0      setosa   50
1  versicolor   50
2   virginica   50

# short version

In [5]:
print(open('short.sql').read())

select
    species,
    count(*)
        as num,
group by
    1

In [6]:
iris.sql('short.sql')

      species  num
0      setosa   50
1  versicolor   50
2   virginica   50